Revit 2027 API
Connector.ConnectorManager Property
The connector manager of the connector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ConnectorManager ConnectorManager { get; }
Public ReadOnly Property ConnectorManager As ConnectorManager
	Get
public:
property ConnectorManager^ ConnectorManager {
	ConnectorManager^ get ();
}
member ConnectorManager : ConnectorManager with get
Property Value
ConnectorManager
Exceptions
Exception | Condition
InvalidOperationException |  Thrown on failure to get connector manager.
See Also
Reference
Connector Class
Autodesk.Revit.DB Namespace